notes/penalized_timeshift.tex
% Created 2021-04-12 Mon 16:54
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Daniel Iong}
\date{\today}
\title{Penalized shifted and trimmed RMSE}
\hypersetup{
 pdfauthor={Daniel Iong},
 pdftitle={Penalized shifted and trimmed RMSE},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
Let \(x_{t}\), \(y_{t}\), \(t = 1, \dots T\), denote the simulated and observed trajectory, respectively, for a given configuration. To account for time-shifts, we compute the following modified MSE metric.

\begin{equation}
\underset{s \in \mathcal{S}}{\text{min}} \sum_{t=T_{\text{min}}}^{T_{\text{max}}} (y_{t} - x_{t+s})^{2}
\label{eq:rmse}
\end{equation}

where \(\mathcal{S} = {-48,\dots,48}\), \(T_{\text{min}} = 0.2 \times T\), and \(T_{\text{max}} = 0.8 \times T\).

\section{Penalizing timeshift}
\label{sec:org95389e3}

For many of the configurations, the shift \(s\) that minimizes \(\ref{eq:rmse}\) is -48 or 48 which is not desirable. Therefore, we penalize timeshift by adding the following term to \(\ref{eq:rmse}\).

\begin{equation}
 P_{s}(x) = (s / s_{\text{max}})^{2} \text{Var}(\tilde{x})
\end{equation}

where \(s_{\text{max}} = 48\) and \(\tilde{x} = \{x_{t}: t = T_{\text{min}},\dots,T_{\text{max}}\}\). We tried a couple different penalties but the one based on variance seems to be the most reasonable.

\section{Penalized shifted and trimmed RMSE}
\label{sec:org2dec44d}

The final RMSE metric we calculate is given by

\begin{equation*}
\sqrt{\underset{s \in \mathcal{S}}{\text{min}} \Big\{ \sum_{t=T_{\text{min}}}^{T_{\text{max}}} (y_{t} - x_{t+s})^{2} + P_{s}(x) \Big\}
\end{equation*}
\end{document}
